import torch
from torch.utils.data import DataLoader, TensorDataset

torch.manual_seed(1)

# 假设我们有一个数据集
x = torch.rand(8, 4)  # 输入数据
y = torch.rand(8, 1)  # 目标数据
dataset = TensorDataset(x, y)  # 创建一个张量数据集

print(x)
print(y)

# 使用DataLoader并设置shuffle=True来打乱数据
dataloader = DataLoader(dataset, batch_size=3, shuffle=True)

# 在训练循环中使用DataLoader
for batch in dataloader:
    inputs, labels = batch  # 在这里，inputs和labels是经过打乱的数据
    print('inputs', inputs)
    print('labels', labels)
    print('--- Batch End ---')

# 进行你的训练步骤...


'''
[0.7576, 0.2793, 0.4031, 0.7347],[0.8300]
[0.0293, 0.7999, 0.3971, 0.7544],[0.0444]
[0.5695, 0.4388, 0.6387, 0.5247],[0.0246]
[0.6826, 0.3051, 0.4635, 0.4550],[0.2588]
[0.5725, 0.4980, 0.9371, 0.6556],[0.9391]
[0.3138, 0.1980, 0.4162, 0.2843],[0.4167]
[0.3398, 0.5239, 0.7981, 0.7718],[0.7140]
[0.0112, 0.8100, 0.6397, 0.9743],[0.2676]
'''

''' batch_1
[0.6826, 0.3051, 0.4635, 0.4550],[0.2588]
[0.3398, 0.5239, 0.7981, 0.7718],[0.7140]
[0.7576, 0.2793, 0.4031, 0.7347],[0.8300]
'''

''' batch_2
[0.3138, 0.1980, 0.4162, 0.2843],[0.4167]
[0.5695, 0.4388, 0.6387, 0.5247],[0.0246]
[0.0112, 0.8100, 0.6397, 0.9743],[0.2676]
'''

''' batch_3
[0.0293, 0.7999, 0.3971, 0.7544],[0.0444]
[0.5725, 0.4980, 0.9371, 0.6556],[0.9391]
'''